6-Ingeniería De Software/Proyecto/app/views/actividads/index.html.erb

SELECT "admins".* FROM "admins" WHERE "admins"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---

          <% if current_user.admin.present? %>

SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = $1 AND "requests"."status" = $2  [["user_id", 2], ["status", "accepted"]]
SELECT "actividads".* FROM "actividads" WHERE "actividads"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <h3>Actividades en las que Participo</h3>
      <% solicitudes_user = Request.where(user: current_user, status: 'accepted') %>
      <% solicitudes_user.each do |solicitud| %>
        <% actividad = Actividad.find(solicitud.actividad_id) %>