6-Ingeniería De Software/Proyecto/app/views/actividads/show.html.erb

      <h2 class="title">Solicitudes recibidas:</h2>
      <% @actividad.requests.each do |request| %>
---
SELECT "requests".* FROM "requests" WHERE "requests"."actividad_id" = $1  [["actividad_id", 3]]

          <h2 class="title">Reseñas:</h2>
          <% @actividad.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."actividad_id" = $1  [["actividad_id", 3]]