6-Ingeniería De Software/Proyecto/app/views/requests/_form.html.erb

<% actividades_disponibles = Actividad.where.not(user: current_user) %>
---
SELECT "actividads".* FROM "actividads" WHERE "actividads"."user_id" != $1  [["user_id", 2]]