6-Ingeniería De Software/Proyecto/app/views/requests/index.html.erb

  <% if user_signed_in? %>
    <% actividades_disponibles = Actividad.where.not(user: current_user).where.not(id: current_user.requests.pluck(:actividad_id)) %>
---
SELECT "requests"."actividad_id" FROM "requests" WHERE "requests"."user_id" = $1  [["user_id", 2]]