6-Ingeniería De Software/Proyecto/app/views/requests/show.html.erb

SELECT "actividads".* FROM "actividads" WHERE "actividads"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<% if user_signed_in? %>
    <% actividad_actual = Actividad.find(@request.actividad_id) %>