6-Ingeniería De Software/Proyecto/app/controllers/actividads_controller.rb

SELECT "actividads".* FROM "actividads"
---
  def index
    @actividads = Actividad.all

SELECT "actividads".* FROM "actividads" WHERE "actividads"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @actividad = Actividad.find(params[:id])

SELECT "actividads".* FROM "actividads" WHERE "actividads"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @actividad = Actividad.find(params[:id])

INSERT INTO "actividads" ("titulo", "cantidad_personas", "precio", "fecha", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @actividad = current_user.actividads.build(actividad_params)
    @actividad.user = current_user
    if @actividad.save

SELECT "actividads".* FROM "actividads" WHERE "actividads"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "actividads" SET "titulo" = $1, "cantidad_personas" = $2, "precio" = $3, "updated_at" = $4 WHERE "actividads"."id" = $5  [["titulo", "Clases de Brawl"], ["cantidad_personas", 5], ["precio", 15], ["updated_at", "2024-06-13 20:05:21.916956"], ["id", 2]]
---
  def update
    @actividad = Actividad.find(params[:id])
    if @actividad.update(actividad_params)

SELECT "actividads".* FROM "actividads" WHERE "actividads"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "actividads" WHERE "actividads"."id" = $1  [["id", 3]]
---
  def destroy
    @actividad = Actividad.find(params[:id])
    @actividad.destroy