6-Ingeniería De Software/Proyecto/app/controllers/chats_controller.rb

  def index
    @chats = Chat.where(user1: current_user).or(Chat.where(user2: current_user))
    @actividads = Actividad.all
    # actividades sin chat por parte del current_user
    @actividads_without_chat = @actividads.select { |actividad| !Chat.between_users(current_user, actividad.user).any? }
---
SELECT "chats".* FROM "chats" WHERE ("chats"."user1_id" = $1 OR "chats"."user2_id" = $2)  [["user1_id", 2], ["user2_id", 2]]
SELECT "actividads".* FROM "actividads"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @chat = Chat.find(params[:id])
    @messages = @chat.messages.order(created_at: :asc)
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" = $1 ORDER BY "messages"."created_at" ASC  [["chat_id", 1]]

  def create
    actividad_id = params[:chat][:actividad_id]
    user2_id = Actividad.find(actividad_id).user

    existing_chat = Chat.between_users(current_user, user2_id).first
    if existing_chat
      redirect_to chat_path(existing_chat)
    else
      @chat = Chat.new(actividad_id: actividad_id, user1: current_user, user2: user2_id)
      if @chat.save
---
SELECT "actividads".* FROM "actividads" WHERE "actividads"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "chats" ("actividad_id", "user1_id", "user2_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["actividad_id", 2], ["user1_id", 2], ["user2_id", 1], ["created_at", "2024-06-13 20:05:49.171592"], ["updated_at", "2024-06-13 20:05:49.171592"]]

  def destroy
    @chat = Chat.find(params[:id])
    @chat.destroy
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "chats" WHERE "chats"."id" = $1  [["id", 1]]

  def set_chat
    @chat = Chat.find(params[:id])
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]