6-Ingeniería De Software/Proyecto/app/controllers/messages_controller.rb

SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("chat_id", "user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["chat_id", 1], ["user_id", 2], ["content", "soy el admin"], ["created_at", "2024-06-13 20:05:56.753443"], ["updated_at", "2024-06-13 20:05:56.753443"]]
---
  def create
    @chat = Chat.find(params[:message][:chat_id])
    @message = Message.new(message_params)
    @message.user = current_user

    if @message.save