6-Ingeniería De Software/Proyecto/app/controllers/requests_controller.rb

SELECT "actividads".* FROM "actividads" WHERE "actividads"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "requests" ("description", "status", "fecha", "user_id", "actividad_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    #@request = Request.new(request_params)
    @actividad = Actividad.find(request_params[:actividad_id])
    @request = current_user.requests.build(request_params)

    #@request.user = current_user
    @request.actividad = @actividad
    @request.fecha = @actividad.fecha
    @request.status = "pending"


    if @actividad.user == current_user
      redirect_to requests_path, alert: 'No puedes hacer una solicitud a tu propia actividad.'
    elsif @request.save

SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = $1 AND "requests"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "requests" WHERE "requests"."id" = $1  [["id", 1]]
---
  def destroy
    @request = current_user.requests.find(params[:id])
    @request.destroy

SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "requests" SET "status" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["status", "accepted"], ["updated_at", "2024-06-15 01:54:06.122642"], ["id", 1]]
INSERT INTO "participations" ("user_id", "actividad_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["actividad_id", 1], ["created_at", "2024-06-15 01:54:06.159388"], ["updated_at", "2024-06-15 01:54:06.159388"]]
---
  def accept
    @request = Request.find(params[:id])
    if @request.update(status: "accepted")
      # Crear una nueva participación
      Participation.create(user_id: @request.user_id, actividad_id: @request.actividad_id)

SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "requests" SET "status" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["status", "rejected"], ["updated_at", "2024-06-15 01:54:09.481244"], ["id", 1]]
DELETE FROM "requests" WHERE "requests"."id" = $1  [["id", 1]]
---
  def reject
    @request = Request.find(params[:id])
    if @request.update(status: "rejected")
      # Eliminar la solicitud
      @request.destroy

SELECT "actividads".* FROM "actividads" WHERE "actividads"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_actividad
    @actividad = Actividad.find(params[:actividad_id])