6-Ingeniería De Software/Proyecto/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("content", "rating", "user_id", "actividad_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "ñee"], ["rating", 2], ["user_id", 1], ["actividad_id", 3], ["created_at", "2024-06-15 02:59:58.741345"], ["updated_at", "2024-06-15 02:59:58.741345"]]
---
  def create
    @review = Review.new(review_params)
    @review.user = current_user

    if @review.save

UPDATE "reviews" SET "content" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["content", "hola, no me gusto mucho"], ["updated_at", "2024-06-17 00:29:51.552186"], ["id", 2]]
---
  def update
    if @review.update(review_params)