6-Ingeniería De Software/Proyecto/app/models/review.rb

  def unique_review_by_user_per_actividad
    existing_review = Review.find_by(user_id: user_id, actividad_id: actividad_id)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1 AND "reviews"."actividad_id" = $2 LIMIT $3  [["user_id", 1], ["actividad_id", 3], ["LIMIT", 1]]